package ru.top.homework10.controller;

//ЗАДАНИЕ: РЕАЛИЗАЦИЯ CRUD ОПЕРАЦИЙ ДЛЯ СУЩНОСТИ STUDENT
//Техническое задание
//
//Цель задачи
//Создать полнофункциональное  приложение с CRUD операциями .
//Вернуть HTTP Statuses правильно!!
//
//Требования
//Структура Students:
//
// Students (
//    Id
//    Name
//    Surname
//    Age
//    Phone ne obyazatelnoe pole
//    Email  unikalnoe pole
//);
//
//
//Требуемый функционал
//1. Операция CREATE - Добавление записей
//Добавление одного студента
//
//Проверка уникальности email
//
//Валидация входных данных (возраст, email формат)
//
//2. Операция READ - Чтение записей
//Получение всех студентов
//
//Получение студента по ID
//
//Поиск по имени и фамилии
//
//Поиск по email
//
//Фильтрация по возрасту
//
//3. Операция UPDATE - Обновление записей
//Обновление данных существующего студента по ID
//
//Частичное обновление полей
//
//Проверка уникальности email при обновлении
//
//4. Операция DELETE - Удаление записей
//Удаление студента по ID
//
//Удаление всех записей
//
//
//1. Показать всех студентов
//2. Найти студента по ID
//3. Добавить нового студента
//4. Обновить данные студента
//5. Удалить студента
//6. Поиск по имени/фамилии
//7. Поиск по email
//8. Фильтр по возрасту
//
//




public class StudentController {

}
